In [9]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split

In [3]:
!git clone https://github.com/avidutta20/challenge_may21

Cloning into 'challenge_may21'...
remote: Enumerating objects: 29, done.
remote: Counting objects: 100% (29/29), done.
remote: Compressing objects: 100% (23/23), done.
remote: Total 29 (delta 9), reused 19 (delta 4), pack-reused 0
Unpacking objects: 100% (29/29), done.

In [43]:
df = pd.read_csv('/content/challenge_may21/dataset/av_jobathon_may21_train.csv')
df

              ID  Gender  Age  ... Avg_Account_Balance Is_Active Is_Lead
0       NNVBBKZB  Female   73  ...             1045696        No       0
1       IDD62UNG  Female   30  ...              581988        No       0
2       HD3DSEMC  Female   56  ...             1484315       Yes       0
3       BF3NC7KV    Male   34  ...              470454        No       0
4       TEASRWXV  Female   30  ...              886787        No       0
...          ...     ...  ...  ...                 ...       ...     ...
245720  BPAWWXZN    Male   51  ...             1925586        No       0
245721  HFNB7JY8    Male   27  ...              862952       Yes       0
245722  GEHAUCWT  Female   26  ...              670659        No       0
245723  GE7V8SAH  Female   28  ...              407504        No       0
245724  BOCZSWLJ    Male   29  ...             1129276        No       0

[245725 rows x 11 columns]

In [44]:
for column in df.columns:
  print(f'{column}:\t {df[column].unique()}')

ID:	 ['NNVBBKZB' 'IDD62UNG' 'HD3DSEMC' ... 'GEHAUCWT' 'GE7V8SAH' 'BOCZSWLJ']
Gender:	 ['Female' 'Male']
Age:	 [73 30 56 34 62 48 40 55 53 27 31 79 33 46 59 65 37 44 32 50 70 25 52 26
 67 29 41 49 63 61 64 60 76 57 36 28 58 43 35 71 82 45 42 54 47 78 51 68
 83 39 84 24 38 74 81 69 75 85 66 80 72 77 23]
Region_Code:	 ['RG268' 'RG277' 'RG270' 'RG282' 'RG261' 'RG265' 'RG283' 'RG254' 'RG269'
 'RG257' 'RG279' 'RG280' 'RG252' 'RG284' 'RG259' 'RG281' 'RG258' 'RG266'
 'RG260' 'RG274' 'RG256' 'RG275' 'RG273' 'RG267' 'RG272' 'RG251' 'RG262'
 'RG264' 'RG278' 'RG276' 'RG263' 'RG250' 'RG255' 'RG253' 'RG271']
Occupation:	 ['Other' 'Salaried' 'Self_Employed' 'Entrepreneur']
Channel_Code:	 ['X3' 'X1' 'X2' 'X4']
Vintage:	 [ 43  32  26  19  33  20  13  38  49 123  14  31  57  69  97  15  63  21
  99  56  87  62  55 103 104  93  61  91  27  39  50  45  25 117  80  81
  73  67 109  92 122  75  79 121 111 116  85 115  86  37  74 110  44   9
  68  51  98 105 127 129 133   8   7 128 135 134]
Credit_Product:	 ['No' nan 'Yes']
Avg_Account_Balance:	 [1045696  581988 1484315 ...  368949 1925586 1129276]
Is_Active:	 ['No' 'Yes']
Is_Lead:	 [0 1]

In [45]:
df.iloc[:,0:10]

              ID  Gender  Age  ... Credit_Product Avg_Account_Balance Is_Active
0       NNVBBKZB  Female   73  ...             No             1045696        No
1       IDD62UNG  Female   30  ...             No              581988        No
2       HD3DSEMC  Female   56  ...             No             1484315       Yes
3       BF3NC7KV    Male   34  ...             No              470454        No
4       TEASRWXV  Female   30  ...             No              886787        No
...          ...     ...  ...  ...            ...                 ...       ...
245720  BPAWWXZN    Male   51  ...            NaN             1925586        No
245721  HFNB7JY8    Male   27  ...             No              862952       Yes
245722  GEHAUCWT  Female   26  ...             No              670659        No
245723  GE7V8SAH  Female   28  ...             No              407504        No
245724  BOCZSWLJ    Male   29  ...             No             1129276        No

[245725 rows x 10 columns]

In [46]:
feature_list = df.columns[0:10]

In [47]:
x_train,x_test,y_train,y_test = train_test_split(df[feature_list],df['Is_Lead'],test_size=0.25,random_state = 25)
x_test

              ID  Gender  Age  ... Credit_Product Avg_Account_Balance Is_Active
171739  FEZQ2WQ8  Female   30  ...             No             1237838        No
98848   XMQFAYY9    Male   29  ...             No              678162       Yes
184607  PLDBQWA5  Female   29  ...            Yes              343593        No
61725   GYQXRGAE    Male   28  ...             No              960701       Yes
48107   EOHUX2XN    Male   57  ...            NaN             2209273        No
...          ...     ...  ...  ...            ...                 ...       ...
236899  LXTMUFCV    Male   65  ...             No             1914950       Yes
65610   7SDRUTFF  Female   28  ...            Yes             1052300        No
42881   H376WU9T  Female   27  ...             No              387123        No
199081  BH7NBQSC    Male   43  ...             No              630387       Yes
104851  3ZDXKNQY    Male   38  ...             No              336206       Yes

[61432 rows x 10 columns]

In [48]:
for column in x_train.columns:
  print(f'{column}:\t {x_train[column].unique()}')

ID:	 ['TUGWPBZM' 'PAMZ9ZNB' 'TZCDTWGC' ... 'TTPMMXC6' 'HDNC7OEX' 'JPQCMZGK']
Gender:	 ['Male' 'Female']
Age:	 [44 50 77 74 25 49 52 72 27 70 47 31 48 30 67 79 80 34 36 66 37 28 57 56
 45 54 42 59 63 38 33 40 82 69 62 65 46 41 29 26 60 39 35 32 51 83 58 76
 84 43 61 55 73 71 53 68 64 81 24 78 85 75 23]
Region_Code:	 ['RG268' 'RG252' 'RG284' 'RG283' 'RG271' 'RG256' 'RG254' 'RG260' 'RG251'
 'RG276' 'RG253' 'RG261' 'RG262' 'RG257' 'RG264' 'RG270' 'RG255' 'RG280'
 'RG250' 'RG282' 'RG263' 'RG269' 'RG273' 'RG259' 'RG266' 'RG258' 'RG279'
 'RG277' 'RG275' 'RG274' 'RG281' 'RG272' 'RG278' 'RG265' 'RG267']
Occupation:	 ['Self_Employed' 'Other' 'Salaried' 'Entrepreneur']
Channel_Code:	 ['X3' 'X2' 'X1' 'X4']
Vintage:	 [ 87  69  81  14  21  73  62  92  15  97  86  26  19 103  57  43  98  33
  27  31  25  74  99  67  75  13  20  56  32  55  91  44  68  37  51 128
  63 127  45  79 104 109  49 121  85 129  80 117   7  50 110  93  38   9
 122  39 116  61 111 115 105 123   8 133 134 135]
Credit_Product:	 ['No' 'Yes' nan]
Avg_Account_Balance:	 [ 543460  891895 1163416 ... 2039817 1186040 1649000]
Is_Active:	 ['No' 'Yes']

In [ ]:
def process_data(x_train):
  pass

In [49]:
def regioncode_process(x_train, col = 'Region_Code'):

  # converting region_code to integer
  x_train[col] = x_train[col].apply(lambda x: int(x[2:]))
  return x_train

In [51]:
regioncode_process(x_train)
x_train['Region_Code'].unique()

array([268, 252, 284, 283, 271, 256, 254, 260, 251, 276, 253, 261, 262,
       257, 264, 270, 255, 280, 250, 282, 263, 269, 273, 259, 266, 258,
       279, 277, 275, 274, 281, 272, 278, 265, 267])

In [55]:
x_test

              ID  Gender  Age  ... Credit_Product Avg_Account_Balance Is_Active
171739  FEZQ2WQ8  Female   30  ...             No             1237838        No
98848   XMQFAYY9    Male   29  ...             No              678162       Yes
184607  PLDBQWA5  Female   29  ...            Yes              343593        No
61725   GYQXRGAE    Male   28  ...             No              960701       Yes
48107   EOHUX2XN    Male   57  ...            NaN             2209273        No
...          ...     ...  ...  ...            ...                 ...       ...
236899  LXTMUFCV    Male   65  ...             No             1914950       Yes
65610   7SDRUTFF  Female   28  ...            Yes             1052300        No
42881   H376WU9T  Female   27  ...             No              387123        No
199081  BH7NBQSC    Male   43  ...             No              630387       Yes
104851  3ZDXKNQY    Male   38  ...             No              336206       Yes

[61432 rows x 10 columns]

In [70]:
def replace_values(dframe, colname, value_dic):
  for key,value in zip(value_dic.keys(),value_dic.values()):
  # for key in value_dic:
    dframe.loc[dframe[colname]== key, colname] = value
  return dframe

In [71]:
# processing gender values from string to integer
gender_value={'Male':0,
              'Female': 1}
replace_values(x_train,'Gender',gender_value)
x_train

              ID Gender  Age  ...  Credit_Product Avg_Account_Balance Is_Active
188708  TUGWPBZM      0   44  ...              No              543460        No
17007   PAMZ9ZNB      1   50  ...              No              891895       Yes
109929  TZCDTWGC      0   77  ...              No             1163416        No
81455   XGA3SKWF      0   74  ...              No             1720031        No
77866   AGJSTWQH      1   25  ...              No             1489690       Yes
...          ...    ...  ...  ...             ...                 ...       ...
130365  SZWOQ6UA      1   68  ...              No             2039817       Yes
92303   L7QPOBXY      1   34  ...              No              873268       Yes
6618    TTPMMXC6      0   28  ...              No             1186040       Yes
90430   HDNC7OEX      1   50  ...             NaN             1649000       Yes
29828   JPQCMZGK      1   31  ...              No             1309430        No

[184293 rows x 10 columns]

In [74]:
# x_train['Occupation'].unique()
# []
occupation_values = {'Self_Employed':1, 
                     'Other':2, 
                     'Salaried':3, 
                     'Entrepreneur':4 }
replace_values(x_train,'Occupation',occupation_values )
x_train

              ID Gender  Age  ...  Credit_Product Avg_Account_Balance Is_Active
188708  TUGWPBZM      0   44  ...              No              543460        No
17007   PAMZ9ZNB      1   50  ...              No              891895       Yes
109929  TZCDTWGC      0   77  ...              No             1163416        No
81455   XGA3SKWF      0   74  ...              No             1720031        No
77866   AGJSTWQH      1   25  ...              No             1489690       Yes
...          ...    ...  ...  ...             ...                 ...       ...
130365  SZWOQ6UA      1   68  ...              No             2039817       Yes
92303   L7QPOBXY      1   34  ...              No              873268       Yes
6618    TTPMMXC6      0   28  ...              No             1186040       Yes
90430   HDNC7OEX      1   50  ...             NaN             1649000       Yes
29828   JPQCMZGK      1   31  ...              No             1309430        No

[184293 rows x 10 columns]